In [25]:
import pandas as pd  #importing pandas

In [26]:
# C

import pandas as pd
import numpy as np  # to use random functions if needed



np.random.seed(42)  # for reproducibility
n=1000
df =pd.DataFrame(
    { 'Roll_no': np.random.randint(101,101+n),

    'Age': np.random.randint(18,24, size=n),
    'marks': np.random.randint(40,101,size=n),
    'Department': np.random.choice(['CSE', 'ECE', 'BT', 'Automation', 'ME', 'AIML'], size=n)
    })

In [27]:
#Introduce missing values in AGE, MARKS and Department columns randomly
for col in ['Age', 'marks', 'Department']:
    df.loc[df.sample(frac=0.05).index, col] = np.nan    
# Dupilcate Rows/records
pd.concat([df, df.sample(20)], ignore_index=True)
# Introduce invalid ages
df.loc[df.sample(10).index,'Age'] = np.random.choice([-5, 240], size=10)
# Introduce Outliers in marks
df.loc[df.sample(10).index,'marks'] = np.random.choice([-10, 150], size=10)
#Inconsistent entries in Department
df["Department"]= df["Department"].astype(str)
df.loc[df.sample(10).index,'Department'] = df["Department"].str.lower()    

df.tail()

     Roll_no   Age  marks Department
995      203   NaN   43.0        nan
996      203  22.0   59.0        ECE
997      203  18.0   71.0        CSE
998      203  18.0   75.0        ECE
999      203  22.0   89.0       AIML

In [28]:
#pd.concat([df, df.sample(20)], ignore_index=True)

In [29]:
#create a copy of dataframe
df=df.copy()

In [30]:
#stadardize column names
df.columns=(
    df.columns.str.strip()  #remove leading/trailing spaces
    .str.lower()            #convert to lowercase  
    .str.replace(' ', '_')  #replace spaces with underscores             
)

In [31]:
df.columns

Index(['roll_no', 'age', 'marks', 'department'], dtype='object')

In [32]:
#enforce correct data types
df['age']= pd.to_numeric(df['age'], errors='coerce')
df['marks']= pd.to_numeric(df['marks'], errors='coerce')
df['roll_no']=pd.to_numeric(df['roll_no'], errors='coerce')
df['department']= df['department'].astype(str)

In [33]:
# Handling missing values
df['age'].fillna(df['age'].median(), inplace=True)
df['marks'].fillna(df['marks'].mean(), inplace=True)

df['department'].fillna(df['department'].mode()[0], inplace=True)

In [34]:
# handle duplicates
df.drop_duplicates(inplace=True)

In [35]:
df

     roll_no   age  marks  department
0        203  21.0   61.0  Automation
1        203  22.0   60.0          BT
2        203  20.0   45.0         CSE
3        203  22.0   45.0  Automation
4        203  22.0   94.0        AIML
..       ...   ...    ...         ...
990      203  19.0   54.0         ECE
993      203  20.0   68.0          BT
996      203  22.0   59.0         ECE
997      203  18.0   71.0         CSE
998      203  18.0   75.0         ECE

[828 rows x 4 columns]

In [37]:
#Apply validation rules
valid_departments = ['CSE', 'ECE', 'BT', 'Automation', 'ME', 'AIML', 'IT']
df=df[df['department'].isin(valid_departments)]
df

     roll_no   age  marks  department
0        203  21.0   61.0  Automation
1        203  22.0   60.0          BT
2        203  20.0   45.0         CSE
3        203  22.0   45.0  Automation
4        203  22.0   94.0        AIML
..       ...   ...    ...         ...
990      203  19.0   54.0         ECE
993      203  20.0   68.0          BT
996      203  22.0   59.0         ECE
997      203  18.0   71.0         CSE
998      203  18.0   75.0         ECE

[775 rows x 4 columns]

In [38]:
np.random.seed(42)  # for reproducibility
n=1000
df =pd.DataFrame(
    { 'Roll_no': np.random.randint(101,101+n),

    'Age': np.random.randint(18,24, size=n),
    'marks': np.random.randint(40,101,size=n),
    'Department': np.random.choice(['CSE', 'ECE', 'BT', 'Automation', 'ME', 'AIML'], size=n)
    })

In [39]:
#Introduce missing values in AGE, MARKS and Department columns randomly
for col in ['Age', 'marks', 'Department']:
    df.loc[df.sample(frac=0.05).index, col] = np.nan    
# Dupilcate Rows/records
pd.concat([df, df.sample(20)], ignore_index=True)
# Introduce invalid ages
df.loc[df.sample(10).index,'Age'] = np.random.choice([-5, 240], size=10)
# Introduce Outliers in marks
df.loc[df.sample(10).index,'marks'] = np.random.choice([-10, 150], size=10)
#Inconsistent entries in Department
df["Department"]= df["Department"].astype(str)
df.loc[df.sample(10).index,'Department'] = df["Department"].str.lower()    

df.tail()

     Roll_no   Age  marks Department
995      203   NaN   43.0        nan
996      203  22.0   59.0        ECE
997      203  18.0   71.0        CSE
998      203  18.0   75.0        ECE
999      203  22.0   89.0       AIML

In [43]:

df=df[df['marks'].between(0, 100)]
df

     Roll_no   Age  marks  Department
0        203  21.0   61.0  Automation
1        203  22.0   60.0          BT
2        203  20.0   45.0         CSE
3        203  22.0   45.0  Automation
4        203  22.0   94.0        AIML
..       ...   ...    ...         ...
995      203   NaN   43.0         nan
996      203  22.0   59.0         ECE
997      203  18.0   71.0         CSE
998      203  18.0   75.0         ECE
999      203  22.0   89.0        AIML

[941 rows x 4 columns]